{
  "opening": "Lord, meet us gently today and always",
  "prayer": "Jesus, I trust in You.",
  "body": "Each of these readings is pressing toward the same response: a heart fully aligned with God — now — expressed in love that reflects Him.\n\nMoses says, “This day the Lord your God commands you… observe them with all your heart and with all your soul.” Not partial obedience. Not cultural religion. Wholehearted listening. To “hearken” is not passive hearing; it is listening that moves you. God declares, “You are my people,” and then calls them to walk in His ways. Identity and obedience belong together.\n\nPsalm 119 carries the same longing: “Blessed are those who seek Him with their whole heart.” This isn’t about getting everything right. It’s about the direction you are facing. A person can still stumble and yet be turned toward God. “Oh that my ways may be steadfast…” That isn’t a claim of arrival. It’s desire. The wanting comes before the steadiness.\n\nThen Paul removes any temptation to delay: “Behold, now is the acceptable time; behold, now is the day of salvation.” Not someday holiness. Not future alignment. Now.\n\nAnd then Jesus widens the horizon.\n\n“He makes His sun rise on the bad and the good, and causes rain to fall on the just and the unjust.”\n\nGod does not ration sunlight according to our moral calculations. He is not sliding beads — good deed, bad deed, totals measured, verdict issued. The Father sends sun and rain before the counting is complete.\n\nThen Jesus asks, “If you greet only your brothers, what is unusual about that? Do not even pagans do the same?”\n\nHe dismantles conditional righteousness — the kind that loves only those inside our circle: family, church, profession, political comfort, social familiarity. Anyone can love their own. That is natural. Holiness reaches further.\n\nThe question changes. It is no longer, “Do I love those who deserve it?” It becomes, “Do I resemble the Father?” “Be perfect, as your heavenly Father is perfect.” Perfect here does not mean flawless. It means whole. Undivided.\n\nAnd this raises the honest question: how do we know who is just and who is unjust? We don’t. We see behavior. Fragments. Surface. Only God sees the interior — motives, wounds, ignorance, timing, and repentance.\n\nWe are not assigned the role of final judge over souls. Instead of asking who qualifies for my love, I am told to love — because that is what the Father does. He gives sun. He sends rain. He gives breath and life. All of it comes before anyone has earned it.\n\nThis does not pretend that evil is harmless. It simply refuses to make love something I withhold until I feel certain.  I cannot see the whole story of another soul. But I can govern the posture of my own.\n\nWhole heart. Now. Love that resembles the Father.\n\n"
}
