{
  "opening": "Lord, meet us gently today and always",
  "prayer": "Jesus, I trust in You.",
  "body": "“But Jesus came and touched them, saying, ‘Rise, and do not be afraid.\"\n\nThe Transfiguration is a revelation of glory before suffering. Glory breaks through. His face shines. Moses and Elijah appear. A cloud overshadows them. The Father speaks: “This is my beloved Son… listen to Him.” The disciples fall face down in fear.\n\nAnd then — Jesus comes and touches them.\n\nThis moment comes after Caesarea Philippi. In Matthew 16:13–19, in a region filled with pagan shrines to Pan, carved into massive rock cliffs — a place associated with the “gates of Hades” — Jesus asks, “Who do you say that I am?” Peter answers, “You are the Messiah, the Son of the living God.”\n\nIn Matthew’s Gospel alone, Jesus responds with the language of the rock and the keys: “You are Peter, and upon this rock I will build my Church… the gates of the netherworld shall not prevail against it. I will give you the keys of the kingdom of heaven.” Mark and Luke record Peter’s confession, but only Matthew includes this expansion — what later theology calls Petrine authority.\n\nYet immediately after this, Jesus predicts His suffering and death. And He said, ‘Do not tell the vision to anyone until the Son of Man has been raised from the dead.’” The Messiah will suffer. The Messiah will be killed. They do not understand. They fear loss. What they thought they knew begins to unravel.\n\nThen He leads Peter, James, and John up the mountain. It is not clear exactly how long before the Crucifixion this occurs — some theological thought suggests about six months — but the timing feels deliberate. Before they watch Him be disfigured, they see Him radiant. Before the scandal of the Cross, they see His glory.\n\nThey collapse under it.\n\nAnd He touches them.\n\nThe same One who says, “Take up your cross,” also says, “Do not be afraid.” The touch comes before the descent. Because they still have to walk down the mountain. They still have to face Jerusalem. They still have to watch Him die.\n\nHe prepares them, even in their confusion. He steadies them before the suffering comes. The authority given to Peter does not remove fear. It does not prevent failure. It means Christ builds, sustains, and steadies.\n\nWe all participate in carrying a cross. Often we do not understand it. Often we fear what it will cost. We misunderstand Him, just as they did. We collapse under what feels too heavy — glory or grief.\n\nAnd still, He comes close.\n\nHe touches.\n\nHe says, “Rise.”\n\nThe cross remains. But so does His hand."
}
